<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Uses parent recipe to download and rename package, then will upload to Jamf and set up patch policy and update Self Service policy.</string>
		<key>Identifier</key>
		<string>com.github.npm.jamf-upload.zoom</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Applications</string>
			<key>NAME</key>
			<string>Zoom</string>
			<key>UPDATE_PREDICATE</key>
			<string>pkg_uploaded == False</string>
			<key>PATCH_TEMPLATE</key>
			<string>PatchPolicy-Zoom.xml</string>
			<key>POLICY_NAME</key>
			<string>Zoom</string>
			<key>POLICY_CATEGORY</key>
			<string>Applications</string>
			<key>POLICY_TEMPLATE</key>
			<string>UpdatePolicy.xml</string>
			<key>SELF_SERVICE_ICON</key>
			<string>%NAME%.png</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string>Downloads and installs the latest version of Zoom on your computer.</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.github.npm.pkg2.Zoom</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
					<key>replace_pkg</key>
					<string>True</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>patch_softwaretitle</key>
					<string>%NAME%</string>
					<key>patch_name</key>
					<string>%NAME% %version%</string>
					<key>version</key>
					<string>%jamfversion%</string>
					<key>patch_icon_policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>patch_template</key>
					<string>%PATCH_TEMPLATE%</string>
					<key>replace_patch</key>
					<string>false</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPatchUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>replace_policy</key>
					<string>true</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner</string>
			</dict>
		</array>
	</dict>
</plist>
