<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest Cricut Design Space disk image and creates a pkg.</string>
    <key>Identifier</key>
    <string>com.github.npm.pkg.cricutdesignspace</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CricutDesignSpace</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
       
    </array>
</dict>
</plist>
