<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Uses parent recipe to download and rename package, then will upload to Jamf and set up patch policy and update Self Service policy.</string>
		<key>Identifier</key>
		<string>com.github.npm.jamf-upload.WhatsApp</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Applications</string>
			<key>NAME</key>
			<string>WhatsApp</string>
			<key>UPDATE_PREDICATE</key>
			<string>pkg_uploaded == False</string>
			<key>PATCH_TEMPLATE</key>
			<string>PatchPolicy.xml</string>
			<key>POLICY_NAME</key>
			<string>WhatsApp</string>
			<key>POLICY_CATEGORY</key>
			<string>Applications</string>
			<key>POLICY_TEMPLATE</key>
			<string>UpdatePolicy.xml</string>
			<key>SELF_SERVICE_ICON</key>
			<string>%NAME%/%NAME%.png</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string>WhatsApp Messenger is a cross-platform mobile messaging app which allows you to exchange messages without having to pay for SMS. WhatsApp Messenger is available for iPhone, BlackBerry, Android, Windows Phone and Nokia and yes, those phones can all message each other! Because WhatsApp Messenger uses the same internet data plan that you use for email and web browsing, there is no cost to message and stay in touch with your friends.

Version: </string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.3</string>
		<key>ParentRecipe</key>
		<string>com.scriptingosx.pkg.WhatsApp</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>patch_softwaretitle</key>
					<string>%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPatchChecker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>patch_version_found == false</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_category</key>
					<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%UPDATE_PREDICATE%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>patch_softwaretitle</key>
					<string>%NAME%</string>
					<key>patch_name</key>
					<string>%NAME% %version%</string>
					<key>patch_icon_policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>patch_template</key>
					<string>%PATCH_TEMPLATE%</string>
					<key>replace_patch</key>
					<string>false</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPatchUploader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>icon</key>
					<string>%SELF_SERVICE_ICON%</string>
					<key>policy_name</key>
					<string>%POLICY_NAME%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>replace_policy</key>
					<string>true</string>
				</dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner</string>
			</dict>
		</array>
	</dict>
</plist>
