<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Obsidian.</string>
	<key>Identifier</key>
	<string>com.github.npm.pkg.Obsidian</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Obsidian</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>obsidianmd/obsidian-releases</string>
				<key>asset_regex</key>
				<string>Obsidian-[0-9\.]+-universal\.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Obsidian.app</string>
				<key>requirement</key>
				<string>identifier "md.obsidian" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6JSW4SJWN9"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/Obsidian.app</string>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Obsidian.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pkgroot%/Applications/Obsidian.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleName</key>
					<string>app_name</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>version</key>
					<string>%version%</string>
					<key>id</key>
					<string>%bundleid%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
