Description: |
  Downloads the current script of erase-install 11.
Identifier: com.github.npm.pkg.erase-install
MinimumVersion: "2.3"

Input:
  INSTALLER: erase-install

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: "^%INSTALLER%-.*?.pkg$"
      github_repo: grahampugh/erase-install
      include_prereleases: false

  - Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%INSTALLER%-%version%.pkg"
      source_pkg: "%pathname%"
